# CreateViewTemplate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CreateViewTemplate Method
View Class See Also
---
Creates a new view template instance from this view instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public View CreateViewTemplate()
```

Visual Basic
---
```text
Public Function CreateViewTemplate As View
```

Visual C++
---
```text
public:
View^ CreateViewTemplate()
```

# ### Return Value
New view template instance
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The view is not valid for view template creation. |

# See Also
View Class
Autodesk.Revit.DB Namespace